# CreateRotation Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Transform..::..CreateRotation Method
Transform Class See Also
---
Creates a transform that represents a rotation about the given axis at (0, 0, 0).
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public static Transform CreateRotation(
	XYZ axis,
	double angle
)
```

Visual Basic
---
```text
Public Shared Function CreateRotation ( _
	axis As XYZ, _
	angle As Double _
) As Transform
```

Visual C++
---
```text
public:
static Transform^ CreateRotation(
	XYZ^ axis,
	double angle
)
```

# ### Parameters
axis
    Type: Autodesk.Revit.DB..::..XYZ The rotation axis.
angle
    Type: System..::..Double The angle.
# ### Return Value
The new transform.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The given value for angle is not finite |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was NULL |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | axis has zero length. |

# See Also
Transform Class
Autodesk.Revit.DB Namespace